quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {'question': 'Что такое переменная в программировании?',
     'options': ['Константа, значение которой не изменяется', 'Именованная область памяти, в которой хранится значение',
                 'Команда для выполнения операции', 'Тип данных'],
     'correct_option': 1
     },
    {'question': 'Какой из следующих операторов используется для сравнения в Python?',
     'options': ['=', '+=', '-=', '=='],
     'correct_option': 3
     },
    {'question': 'Что такое функция в программировании?',
     'options': ['Комментарий в коде', 'Способ повторного использования кода', 'Метод сортировки данных',
                 'Тип переменной'],
     'correct_option': 1
     },
    {'question': 'Какой из следующих типов данных используется для хранения текста в Python?',
     'options': ['int', 'float', 'str', 'bool'],
     'correct_option': 2
     },
    {'question': 'Какой метод используется для добавления элемента в конец списка в Python?',
     'options': ['append()', 'add()', 'insert()', 'push()'],
     'correct_option': 0
     },
    {'question': 'Что такое цикл в программировании?',
     'options': ['Процесс проверки услови', 'Команда для остановки программы',
                 'Последовательное выполнение набора инструкций несколько раз',
                 'Способ объявления переменных'],
     'correct_option': 2
     },
    {'question': 'Какой из следующих символов используется для комментария в Python?',
     'options': ['#', '//', '/*', '**'],
     'correct_option': 0
     },
    {'question': 'Какое из следующих утверждений верно для Python?',
     'options': ['Python - это компилируемый язык',
                 'Python - это язык с низким уровнем абстракции',
                 'Python использует отступы для определения блоков кода',
                 'Python не поддерживает объектно-ориентированное программирование'],
     'correct_option': 2
     }
]
